import java.util.Scanner;

public class Lesson4 {
    public static void main(String[] args) {
//        double money = 10.0;
//        if (money > 100) {
//            System.out.println("У вас много денег");
//        } else {
//            System.out.println("У вас мало денег");
//        }


//        Пользователь вводит число (2, 3, 4, 5)
//        Scanner sc = new Scanner(System.in);
//        int mark = sc.nextInt();
//        if (mark == 2){
//            System.out.println("Плохо");
//        } else if (mark == 3) {
//            System.out.println("Удовлетворительно");
//        } else if (mark == 4) {
//            System.out.println("Хорошо");
//        } else if (mark == 5) {
//            System.out.println("Отлично");
//        } else {
//            System.out.println("Некорректное число");
//        }

//        Вложенный условный оператор
//        Пользовователь вводит строку (пол) и число (возраст)
//        Женщина девочка
//        Мужчина мальчик
//
//        String pol = sc.nextLine();
//        int vozrast = sc.nextInt();
//
//        if (pol.equals("женский")) {
//            if (vozrast >= 18) {
//                System.out.println("Женщина");
//            } else {
//                System.out.println("Девочка");
//            }
//        } else {
//            if (vozrast >= 17) {
//                System.out.println("Мужчина");
//            } else {
//                System.out.println("Мальчик");
//            }
//        }
//
//        if (pol.equals("женский") && vozrast >= 18) {
//            System.out.println("Женщина");
//        } else if (pol.equals("женский") && vozrast < 18) {
//            System.out.println("Девочка");
//        } else if (pol.equals("мужской") && vozrast >= 18) {
//            System.out.println("мужчина");
//        } else {
//            System.out.println("Мальчик");
//        }
//
//        // Тернарный оператор
//        int age = sc.nextInt();
//        if (age >= 18) {
//
//        } else {
//
//        }

//        System.out.println(age >= 18 ? "Ты взрослый" : "Ты ребенок");
//
//        //Определите переменную temperature со значением 25
//        // и используйте тернарный оператор для вывода
//        // "Warm" если температура больше 20, иначе "Cold".
//        int temperature = 25;
//        System.out.println(temperature > 20 ? "Warm" : "Cold");
//
//        //Напишите код, который использует тернарный оператор для определения, является ли число number четным.
//        int number = sc.nextInt();
//        System.out.println(number % 2 == 0 ? "Even" : "Uneven");

//        switch .. case (старая версия)

//        int mark = sc.nextInt();
//        // Выражение, разные значения которого мы хотим рассмотреть
//        switch (mark) {
//            case 1, 2, 3:
//                System.out.println("Пересдать");
//                break;
//            case 4:
//                System.out.println("Хорошо");
//                break;
//            case 5:
//                System.out.println("Отлично");
//                break;
//        }

        // Создайте программу,
        // которая принимает число от 1 до 4 и выводит соответствующий сезон года.
//        int sezon = sc.nextInt();
//        switch (sezon) {
//            case 1:
//                System.out.println("Winter");
//                break;
//            case 2:
//                System.out.println("Spring");
//                break;
//            case 3:
//                System.out.println("Summer");
//                break;
//            case 4:
//                System.out.println("Fall");
//                break;
//            default:
//                System.out.println("Некорректное число");
//        }

//        String mark = sc.nextLine();

//        switch (mark){
//            case "A" -> {
//                System.out.println("Отлично");
//                System.out.println("Поздравляю");
//            }
//            case "B" -> System.out.println("Хорошо");
//            case "C" -> System.out.println("Удовлетворительно");
//            default -> System.out.println("Некорректная оценка");
//        }

        // Напишите switch-case, который определяет,
        // является ли введённый день недели выходным или рабочим днём.
//        int den = sc.nextInt();
//        switch (den) {
//            case 1, 2, 3, 4, 5 -> System.out.println("Weekday");
//            case 6, 7 -> System.out.println("Weekend");
//            default -> System.out.println("Invalid number");
//        }


        // Циклы - конструкция, позволяющая повторять какой-то участок кода
//        System.out.println(1);
//        System.out.println(2);
//        System.out.println(3);
//        System.out.println(4);
//        System.out.println(5);

//        int i = 1;
//        // скобки можно не писать (если оператор 1)
//        while (i <= 5) {
//            System.out.println(i++);
//        }
//
////        Распечатать все значения от 5 до 1
//        int e = 5;
//        while (e >= 1)
//            System.out.println(e--);

//        Пользователь вводит числа до тех пор, пока не будет введен 0. Посчитать кол-во введенных чисел



    }
}
